{
  "WorkshopId": 1804499742,
  "Title": "QudUX",
  "Description": "Unfortunately, this mod doesn't add ducks to Qud.\r\n\r\nBut it does do this other stuff, so far:\r\n\r\n[h1][b]Track Visited Locations[/b][/h1]\r\n[img]https://i.imgur.com/7EjlkMb.png[/img]\r\nThe journal now indicates whether you've ever visited a location.\r\n  • [i]Green check mark:[/i] You've explored here before.\r\n  • [i]Grey question mark:[/i] You've never explored this location.\r\n\r\nThis mod also renames all \"some forgotten ruins\" locations with unique names.\r\n\r\n\r\n[h1][b]Find Village Quest Givers[/b][/h1]\r\n[img]https://i.imgur.com/BlUTRuY.png[/img]\r\n[img]https://i.imgur.com/5uez0p5.gif[/img]\r\nAdds new dialog options in villages to help you locate the quest-givers more quickly. If you ask a villager to help you find the quest giver, a visual effect shows you where they are.\r\n\r\n\r\n[h1][b]Customize Your Character[/b][/h1]\r\nPick your character's sprite on the Character Creation screen.\r\n[img]https://i.imgur.com/CamnbBh.gif[/img]\r\n\r\n\r\n[h1][b]See Ability Cooldowns & Descriptions[/b][/h1]\r\nThe Manage Abilities screen now shows the true (willpower-modifed) cooldown of each ability. It has also been updated to include full descriptions for every ability instead of just the ability name.\r\n[img]https://i.imgur.com/NynBiBP.png[/img]\r\n\r\n\r\n[h1][b]Ask Traders When They'll Restock[/b][/h1]\r\nA new lore-friendly dialog option allows you to ask traders when they'll restock. (Note that the option won't appear until after you actually look at the trader's current stock for at least 1 second and then re-start a new conversation with them.)\r\n[img]https://i.imgur.com/PVhW7Ks.png[/img]\r\n  • Mod includes specialized bear-emote dialog for Sparafucile \r\n  • Traders that don't restock won't get this new dialog option at all\r\n\r\n\r\n[h1][b]See Item & Character Sprites in the UI[/b][/h1]\r\nItem and character sprites now show up in Conversation screens, item interaction menus, and the (L)ook description pop-ups. See what your equipped gear, items, and mutated body parts look like while browsing game menus.\r\n[img]https://i.imgur.com/tOR75Xf.png[/img]\r\n\r\n\r\n[h1][b]See All the Colors[/b][/h1]\r\nThe sidebar message log (and full message log) suffer from a bug where color is removed from text after a line break. The mod fixes this bug so that the message log shows colored text correctly across new lines. Fresh water just got [i]fresher[/i].\r\n[img]https://i.imgur.com/iJL2bL3.gif[/img]\r\n\r\n\r\n[h1][b]Why Can't I Walk into That Zone?[/b][/h1]\r\nWhen trying to enter a new screen/zone, if a wall is blocking you, a small animated text banner will tell you the way is blocked. (The text effect is similar to Mechanimist priests yelling.)\r\n[img]https://i.imgur.com/R39tgib.png[/img]\r\n\r\n\r\n[h1][b]Check Item Value[/b][/h1]\r\nYou can press ALT on the Inventory screen to see each item's value per pound, if you'd like.\r\n[img]https://i.imgur.com/Q74rH3H.png[/img]\r\n  • [i]Optional feature:[/i] If you also use NalathniDragon's [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1791096395]Appraisal mod[/url], this ability is tied to the Appraisal skill.\r\n\r\n\r\n[h1]Footnotes[/h1]\r\n[list][*]Users report that this mod is [u][b]not[/b][/u] compatible with Harmony Injector or Better Abilities Bar.\r\n[*]While you can use this mod with the overlay UI enabled, some features don't work in the overlay UI. For example, character sprites can't be customized during character creation if you're using the Overlay UI (you'll have to turn the overlay UI off temporarily while you create your character if you want to customize your sprite).\r\n[*]You can find this mod's source code [url=https://github.com/egocarib/CavesOfQud-QudUX]on github.[/url]\r\n[*]Shout out to the modders and other good folks on the [url=https://discordapp.com/invite/cavesofqud]Caves of Qud Discord![/url][/list]",
  "Tags": "World, UX, Cosmetic, Script",
  "Visibility": "2",
  "ImagePath": "preview.png"
}